tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1567_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1567_H_
#define _PIC16LF1567_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define PORTC                         53
#define RC0                           54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define PORTD                         62
#define RD0                           63
#define RD1                           64
#define RD2                           65
#define RD3                           66
#define RD4                           67
#define RD5                           68
#define RD6                           69
#define RD7                           70
#define PORTE                         71
#define RE0                           72
#define RE1                           73
#define RE2                           74
#define RE3                           75
#define PIR1                          76
#define TMR1IF                        77
#define TMR2IF                        78
#define SSP2IF                        79
#define SSP1IF                        80
#define TXIF                          81
#define RCIF                          82
#define AD1IF                         83
#define ADIF                          84
#define TMR1GIF                       85
#define PIR2                          86
#define TMR4IF                        87
#define BCL2IF                        88
#define BCL1IF                        89
#define AD2IF                         90
#define TMR0                          91
#define TMR1L                         92
#define TMR1H                         93
#define T1CON                         94
#define TMR1ON                        95
#define nT1SYNC                       96
#define T1CKPS0                       97
#define T1CKPS                        98
#define T1CKPS1                       99
#define TMR1CS0                       100
#define TMR1CS                        101
#define TMR1CS1                       102
#define T1GCON                        103
#define T1GSS0                        104
#define T1GSS                         105
#define T1GVAL                        106
#define T1GGO_nDONE                   107
#define T1GCON_GO                     108
#define T1GSPM                        109
#define T1GTM                         110
#define T1GPOL                        111
#define TMR1GE                        112
#define TMR2                          113
#define PR2                           114
#define T2CON                         115
#define T2CKPS0                       116
#define T2CKPS                        117
#define T2CKPS1                       118
#define TMR2ON                        119
#define T2OUTPS0                      120
#define T2OUTPS                       121
#define T2OUTPS1                      122
#define T2OUTPS2                      123
#define T2OUTPS3                      124
#define TRISA                         125
#define TRISA0                        126
#define TRISA1                        127
#define TRISA2                        128
#define TRISA3                        129
#define TRISA4                        130
#define TRISA5                        131
#define TRISA6                        132
#define TRISA7                        133
#define TRISB                         134
#define TRISB0                        135
#define TRISB1                        136
#define TRISB2                        137
#define TRISB3                        138
#define TRISB4                        139
#define TRISB5                        140
#define TRISB6                        141
#define TRISB7                        142
#define TRISC                         143
#define TRISC0                        144
#define TRISC1                        145
#define TRISC2                        146
#define TRISC3                        147
#define TRISC4                        148
#define TRISC5                        149
#define TRISC6                        150
#define TRISC7                        151
#define TRISD                         152
#define TRISD0                        153
#define TRISD1                        154
#define TRISD2                        155
#define TRISD3                        156
#define TRISD4                        157
#define TRISD5                        158
#define TRISD6                        159
#define TRISD7                        160
#define TRISE                         161
#define TRISE0                        162
#define TRISE1                        163
#define TRISE2                        164
#define TRISE3                        165
#define PIE1                          166
#define TMR1IE                        167
#define TMR2IE                        168
#define SSP2IE                        169
#define SSPIE                         170
#define SSP1IE                        171
#define TXIE                          172
#define RCIE                          173
#define AD1IE                         174
#define ADIE                          175
#define TMR1GIE                       176
#define PIE2                          177
#define TMR4IE                        178
#define BCL2IE                        179
#define BCL1IE                        180
#define AD2IE                         181
#define OPTION_REG                    182
#define PS                            183
#define PS0                           184
#define PS1                           185
#define PS2                           186
#define PSA                           187
#define T0SE                          188
#define TMR0SE                        189
#define T0CS                          190
#define TMR0CS                        191
#define INTEDG                        192
#define nWPUEN                        193
#define PCON                          194
#define nBOR                          195
#define nPOR                          196
#define nRI                           197
#define nRMCLR                        198
#define nRWDT                         199
#define STKUNF                        200
#define STKOVF                        201
#define WDTCON                        202
#define SWDTEN                        203
#define WDTPS                         204
#define WDTPS0                        205
#define WDTPS1                        206
#define WDTPS2                        207
#define WDTPS3                        208
#define WDTPS4                        209
#define OSCCON                        210
#define SCS0                          211
#define SCS                           212
#define SCS1                          213
#define IRCF                          214
#define IRCF0                         215
#define IRCF1                         216
#define IRCF2                         217
#define IRCF3                         218
#define SPLLEN                        219
#define OSCSTAT                       220
#define HFIOFS                        221
#define LFIOFR                        222
#define HFIOFR                        223
#define PLLSR                         224
#define ADRESL                        225
#define ADRESL_ADRESL                 226
#define ADRESH                        227
#define ADRESH_ADRESH                 228
#define ADCON0                        229
#define ADCON0_AD1ON                  230
#define ADCON0_ADON                   231
#define ADCON0_GO_nDONE               232
#define ADCON0_GO                     233
#define ADGO                          234
#define ADCON0_CHS                    235
#define ADCON0_CHS0                   236
#define ADCON0_CHS1                   237
#define ADCON0_CHS2                   238
#define ADCON0_CHS3                   239
#define ADCON0_CHS4                   240
#define ADCON0_CHS5                   241
#define ADCON1                        242
#define ADCON1_ADPREF                 243
#define ADCON1_ADPREF0                244
#define ADCON1_ADPREF1                245
#define ADCON1_GO_nDONE_ALL           246
#define ADCON1_GO_ALL                 247
#define ADCON1_ADNREF                 248
#define ADCON1_ADCS                   249
#define ADCON1_ADFM                   250
#define ADCON2                        251
#define ADCON2_TRIGSEL0               252
#define ADCON2_TRIGSEL                253
#define ADCON2_TRIGSEL1               254
#define ADCON2_TRIGSEL2               255
#define LATA                          256
#define LATA0                         257
#define LATA1                         258
#define LATA2                         259
#define LATA3                         260
#define LATA4                         261
#define LATA5                         262
#define LATA6                         263
#define LATA7                         264
#define LATB                          265
#define LATB0                         266
#define LATB1                         267
#define LATB2                         268
#define LATB3                         269
#define LATB4                         270
#define LATB5                         271
#define LATB6                         272
#define LATB7                         273
#define LATC                          274
#define LATC0                         275
#define LATC1                         276
#define LATC2                         277
#define LATC3                         278
#define LATC4                         279
#define LATC5                         280
#define LATC6                         281
#define LATC7                         282
#define LATD                          283
#define LATD0                         284
#define LATD1                         285
#define LATD2                         286
#define LATD3                         287
#define LATD4                         288
#define LATD5                         289
#define LATD6                         290
#define LATD7                         291
#define LATE                          292
#define LATE0                         293
#define LATE1                         294
#define LATE2                         295
#define BORCON                        296
#define BORRDY                        297
#define BORFS                         298
#define SBOREN                        299
#define FVRCON                        300
#define ADFVR0                        301
#define ADFVR                         302
#define ADFVR1                        303
#define TSRNG                         304
#define TSEN                          305
#define FVRRDY                        306
#define FVREN                         307
#define APFCON                        308
#define GRDASEL                       309
#define GRDBSEL                       310
#define SSSEL                         311
#define ANSA0                         312
#define ANSELA                        313
#define ANSA1                         314
#define ANSA2                         315
#define ANSA3                         316
#define ANSA4                         317
#define ANSA5                         318
#define ANSA6                         319
#define ANSA7                         320
#define ANSB0                         321
#define ANSELB                        322
#define ANSB1                         323
#define ANSB2                         324
#define ANSB3                         325
#define ANSB4                         326
#define ANSB5                         327
#define ANSB6                         328
#define ANSB7                         329
#define ANSC0                         330
#define ANSELC                        331
#define ANSC1                         332
#define ANSC2                         333
#define ANSC3                         334
#define ANSC4                         335
#define ANSC5                         336
#define ANSC6                         337
#define ANSC7                         338
#define ANSELD                        339
#define ANSD0                         340
#define ANSD1                         341
#define ANSD2                         342
#define ANSD3                         343
#define ANSD4                         344
#define ANSD5                         345
#define ANSD6                         346
#define ANSD7                         347
#define ANSELE                        348
#define ANSE0                         349
#define ANSE1                         350
#define ANSE2                         351
#define PMADRL                        352
#define PMADRH                        353
#define PMDATL                        354
#define PMDATH                        355
#define PMCON1                        356
#define RD                            357
#define WR                            358
#define WREN                          359
#define WRERR                         360
#define FREE                          361
#define LWLO                          362
#define CFGS                          363
#define PMCON2                        364
#define RCREG                         365
#define TXREG                         366
#define SPBRGL                        367
#define SPBRGH                        368
#define RCSTA                         369
#define RX9D                          370
#define OERR                          371
#define FERR                          372
#define ADDEN                         373
#define CREN                          374
#define SREN                          375
#define RX9                           376
#define SPEN                          377
#define TXSTA                         378
#define TX9D                          379
#define TRMT                          380
#define BRGH                          381
#define SENDB                         382
#define SYNC                          383
#define TXEN                          384
#define TX9                           385
#define CSRC                          386
#define BAUDCON                       387
#define ABDEN                         388
#define WUE                           389
#define BRG16                         390
#define SCKP                          391
#define RCIDL                         392
#define ABDOVF                        393
#define WPUB0                         394
#define WPUB                          395
#define WPUB1                         396
#define WPUB2                         397
#define WPUB3                         398
#define WPUB4                         399
#define WPUB5                         400
#define WPUB6                         401
#define WPUB7                         402
#define WPUE                          403
#define WPUE3                         404
#define SSP1BUF_BUF                   405
#define SSP1BUF_BUF0                  406
#define SSP1BUF                       407
#define SSP1BUF0                      408
#define SSP1BUF_BUF1                  409
#define SSP1BUF1                      410
#define SSP1BUF_BUF2                  411
#define SSP1BUF2                      412
#define SSP1BUF_BUF3                  413
#define SSP1BUF3                      414
#define SSP1BUF_BUF4                  415
#define SSP1BUF4                      416
#define SSP1BUF_BUF5                  417
#define SSP1BUF5                      418
#define SSP1BUF_BUF6                  419
#define SSP1BUF6                      420
#define SSP1BUF_BUF7                  421
#define SSP1BUF7                      422
#define SSP1ADD_ADD0                  423
#define SSP1ADD_ADD                   424
#define SSP1ADD0                      425
#define SSP1ADD                       426
#define SSP1ADD_ADD1                  427
#define SSP1ADD1                      428
#define SSP1ADD_ADD2                  429
#define SSP1ADD2                      430
#define SSP1ADD_ADD3                  431
#define SSP1ADD3                      432
#define SSP1ADD_ADD4                  433
#define SSP1ADD4                      434
#define SSP1ADD_ADD5                  435
#define SSP1ADD5                      436
#define SSP1ADD_ADD6                  437
#define SSP1ADD6                      438
#define SSP1ADD_ADD7                  439
#define SSP1ADD7                      440
#define SSP1MSK_MSK0                  441
#define SSP1MSK0                      442
#define SSP1MSK_MSK                   443
#define SSP1MSK                       444
#define SSP1MSK_MSK1                  445
#define SSP1MSK1                      446
#define SSP1MSK_MSK2                  447
#define SSP1MSK2                      448
#define SSP1MSK_MSK3                  449
#define SSP1MSK3                      450
#define SSP1MSK_MSK4                  451
#define SSP1MSK4                      452
#define SSP1MSK_MSK5                  453
#define SSP1MSK5                      454
#define SSP1MSK_MSK6                  455
#define SSP1MSK6                      456
#define SSP1MSK_MSK7                  457
#define SSP1MSK7                      458
#define SSP1STAT                      459
#define SSP1STAT_BF                   460
#define SSP1STAT_UA                   461
#define SSP1STAT_R_nW                 462
#define SSP1STAT_S                    463
#define SSP1STAT_P                    464
#define SSP1STAT_D_nA                 465
#define SSP1STAT_CKE                  466
#define SSP1STAT_SMP                  467
#define SSP1CON1                      468
#define SSP1CON1_SSPM                 469
#define SSP1CON1_SSPM0                470
#define SSP1CON1_SSPM1                471
#define SSP1CON1_SSPM2                472
#define SSP1CON1_SSPM3                473
#define SSP1CON1_CKP                  474
#define SSP1CON1_SSPEN                475
#define SSP1CON1_SSPOV                476
#define SSP1CON1_WCOL                 477
#define SSP1CON2                      478
#define SSP1CON2_SEN                  479
#define SSP1CON2_RSEN                 480
#define SSP1CON2_PEN                  481
#define SSP1CON2_RCEN                 482
#define SSP1CON2_ACKEN                483
#define SSP1CON2_ACKDT                484
#define SSP1CON2_ACKSTAT              485
#define SSP1CON2_GCEN                 486
#define SSP1CON3                      487
#define SSP1CON3_DHEN                 488
#define SSP1CON3_AHEN                 489
#define SSP1CON3_SBCDE                490
#define SSP1CON3_SDAHT                491
#define SSP1CON3_BOEN                 492
#define SSP1CON3_SCIE                 493
#define SSP1CON3_PCIE                 494
#define SSP1CON3_ACKTIM               495
#define SSPLVL                        496
#define S1ILS                         497
#define S2ILS                         498
#define SSP2BUF                       499
#define SSP2BUF_BUF0                  500
#define SSP2BUF_BUF                   501
#define SSP2BUF0                      502
#define SSP2BUF_BUF1                  503
#define SSP2BUF1                      504
#define SSP2BUF_BUF2                  505
#define SSP2BUF2                      506
#define SSP2BUF_BUF3                  507
#define SSP2BUF3                      508
#define SSP2BUF_BUF4                  509
#define SSP2BUF4                      510
#define SSP2BUF_BUF5                  511
#define SSP2BUF5                      512
#define SSP2BUF_BUF6                  513
#define SSP2BUF6                      514
#define SSP2BUF_BUF7                  515
#define SSP2BUF7                      516
#define SSP2ADD_ADD0                  517
#define SSP2ADD0                      518
#define SSP2ADD_ADD                   519
#define SSP2ADD                       520
#define SSP2ADD_ADD1                  521
