tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1567_tdd.h
#define SSP2ADD1                      522
#define SSP2ADD_ADD2                  523
#define SSP2ADD2                      524
#define SSP2ADD_ADD3                  525
#define SSP2ADD3                      526
#define SSP2ADD_ADD4                  527
#define SSP2ADD4                      528
#define SSP2ADD_ADD5                  529
#define SSP2ADD5                      530
#define SSP2ADD_ADD6                  531
#define SSP2ADD6                      532
#define SSP2ADD_ADD7                  533
#define SSP2ADD7                      534
#define SSP2MSK_MSK0                  535
#define SSP2MSK                       536
#define SSP2MSK0                      537
#define SSP2MSK_MSK                   538
#define SSP2MSK_MSK1                  539
#define SSP2MSK1                      540
#define SSP2MSK_MSK2                  541
#define SSP2MSK2                      542
#define SSP2MSK_MSK3                  543
#define SSP2MSK3                      544
#define SSP2MSK_MSK4                  545
#define SSP2MSK4                      546
#define SSP2MSK_MSK5                  547
#define SSP2MSK5                      548
#define SSP2MSK_MSK6                  549
#define SSP2MSK6                      550
#define SSP2MSK_MSK7                  551
#define SSP2MSK7                      552
#define SSP2STAT                      553
#define SSP2STAT_BF                   554
#define SSP2STAT_UA                   555
#define SSP2STAT_R_nW                 556
#define SSP2STAT_S                    557
#define SSP2STAT_P                    558
#define SSP2STAT_D_nA                 559
#define SSP2STAT_CKE                  560
#define SSP2STAT_SMP                  561
#define SSP2CON1                      562
#define SSP2CON1_SSPM                 563
#define SSP2CON1_SSPM0                564
#define SSP2CON1_SSPM1                565
#define SSP2CON1_SSPM2                566
#define SSP2CON1_SSPM3                567
#define SSP2CON1_CKP                  568
#define SSP2CON1_SSPEN                569
#define SSP2CON1_SSPOV                570
#define SSP2CON1_WCOL                 571
#define SSP2CON2                      572
#define SSP2CON2_SEN                  573
#define SSP2CON2_RSEN                 574
#define SSP2CON2_PEN                  575
#define SSP2CON2_RCEN                 576
#define SSP2CON2_ACKEN                577
#define SSP2CON2_ACKDT                578
#define SSP2CON2_ACKSTAT              579
#define SSP2CON2_GCEN                 580
#define SSP2CON3                      581
#define SSP2CON3_DHEN                 582
#define SSP2CON3_AHEN                 583
#define SSP2CON3_SBCDE                584
#define SSP2CON3_SDAHT                585
#define SSP2CON3_BOEN                 586
#define SSP2CON3_SCIE                 587
#define SSP2CON3_PCIE                 588
#define SSP2CON3_ACKTIM               589
#define IOCBP                         590
#define IOCBP0                        591
#define IOCBP1                        592
#define IOCBP2                        593
#define IOCBP3                        594
#define IOCBP4                        595
#define IOCBP5                        596
#define IOCBP6                        597
#define IOCBP7                        598
#define IOCBN0                        599
#define IOCBN                         600
#define IOCBN1                        601
#define IOCBN2                        602
#define IOCBN3                        603
#define IOCBN4                        604
#define IOCBN5                        605
#define IOCBN6                        606
#define IOCBN7                        607
#define IOCBF0                        608
#define IOCBF                         609
#define IOCBF1                        610
#define IOCBF2                        611
#define IOCBF3                        612
#define IOCBF4                        613
#define IOCBF5                        614
#define IOCBF6                        615
#define IOCBF7                        616
#define TMR4                          617
#define PR4                           618
#define T4CON                         619
#define T4CKPS0                       620
#define T4CKPS                        621
#define T4CKPS1                       622
#define TMR4ON                        623
#define T4OUTPS                       624
#define T4OUTPS0                      625
#define T4OUTPS1                      626
#define T4OUTPS2                      627
#define T4OUTPS3                      628
#define PWM1DCL                       629
#define PWM1DCL0                      630
#define PWM1DCL1                      631
#define PWM1DCH                       632
#define PWM1DCH0                      633
#define PWM1DCH1                      634
#define PWM1DCH2                      635
#define PWM1DCH3                      636
#define PWM1DCH4                      637
#define PWM1DCH5                      638
#define PWM1DCH6                      639
#define PWM1DCH7                      640
#define PWM1CON                       641
#define PWM1POL                       642
#define PWM1OUT                       643
#define PWM1CON_PWM1OE                644
#define PWM1EN                        645
#define PWM2DCL0                      646
#define PWM2DCL                       647
#define PWM2DCL1                      648
#define PWM2DCH0                      649
#define PWM2DCH                       650
#define PWM2DCH1                      651
#define PWM2DCH2                      652
#define PWM2DCH3                      653
#define PWM2DCH4                      654
#define PWM2DCH5                      655
#define PWM2DCH6                      656
#define PWM2DCH7                      657
#define PWM2CON                       658
#define PWM2POL                       659
#define PWM2OUT                       660
#define PWM2CON_PWM2OE                661
#define PWM2EN                        662
#define PWMTMRS                       663
#define P1TSEL                        664
#define P2TSEL                        665
#define PWM1AOE                       666
#define PWM1OE0                       667
#define PWM1AOE_PWM1OE                668
#define PWM1OE1                       669
#define PWM1OE2                       670
#define PWM1OE3                       671
#define PWM2AOE                       672
#define PWM2OE0                       673
#define PWM2AOE_PWM2OE                674
#define PWM2OE1                       675
#define PWM2OE2                       676
#define PWM2OE3                       677
#define ADCTX                         678
#define A1TX0                         679
#define A1TX1                         680
#define A1TX2                         681
#define A2TX0                         682
#define A2TX1                         683
#define A2TX2                         684
#define AD1TX0                        685
#define TX10                          686
#define TX11                          687
#define TX12                          688
#define TX13                          689
#define TX14                          690
#define TX15                          691
#define TX16                          692
#define TX17                          693
#define AD1TX1                        694
#define TX18                          695
#define TX19                          696
#define TX30                          697
#define TX31                          698
#define TX32                          699
#define TX33                          700
#define TX34                          701
#define TX35                          702
#define AD2TX0                        703
#define TX20                          704
#define TX21                          705
#define TX22                          706
#define TX23                          707
#define TX24                          708
#define TX25                          709
#define TX26                          710
#define TX27                          711
#define AD2TX1                        712
#define TX28                          713
#define TX29                          714
#define TX40                          715
#define TX41                          716
#define TX42                          717
#define TX43                          718
#define TX44                          719
#define TX45                          720
#define AD1CON0                       721
#define AD1CON0_AD1ON                 722
#define AD1CON0_ADON                  723
#define AD1CON0_GO                    724
#define GO_nDONE1                     725
#define AD1CON0_GO_nDONE              726
#define AD1CON0_CHS0                  727
#define AD1CON0_CHS                   728
#define AD1CON0_CHS1                  729
#define AD1CON0_CHS2                  730
#define AD1CON0_CHS3                  731
#define AD1CON0_CHS4                  732
#define AD1CON0_CHS5                  733
#define ADCOMCON                      734
#define ADCOMCON_ADPREF               735
#define ADCOMCON_ADPREF0              736
#define ADCOMCON_ADPREF1              737
#define ADCOMCON_GO_nDONE_ALL         738
#define ADCOMCON_GO_ALL               739
#define ADCOMCON_ADNREF               740
#define ADCS0                         741
#define ADCOMCON_ADCS                 742
#define ADCS1                         743
#define ADCS2                         744
#define ADCOMCON_ADFM                 745
#define AD1CON2                       746
#define AD1CON2_TRIGSEL               747
#define AD1CON2_TRIGSEL0              748
#define AD1CON2_TRIGSEL1              749
#define AD1CON2_TRIGSEL2              750
#define AD1CON3                       751
#define AD1DSEN                       752
#define AD1CON3_ADDSEN                753
#define AD1IPEN                       754
#define AD1CON3_ADIPEN                755
#define AD1CON3_ADIPPOL               756
#define AD1IPPOL                      757
#define AD1EPPOL                      758
#define AD1CON3_ADEPPOL               759
#define ADSTAT                        760
#define AD1STG0                       761
#define ADSTG                         762
#define AD1STG                        763
#define AD1STG1                       764
#define AD1CONV                       765
#define ADCONV                        766
#define AD2STG0                       767
#define AD2STG                        768
#define AD2STG1                       769
#define AD2CONV                       770
#define AD1PRECON                     771
#define AD1PRECON_ADPRE               772
#define AD1PRECON_ADPRE0              773
#define AD1PRECON_ADPRE1              774
#define AD1PRECON_ADPRE2              775
#define AD1PRECON_ADPRE3              776
#define AD1PRECON_ADPRE4              777
#define AD1PRECON_ADPRE5              778
#define AD1PRECON_ADPRE6              779
#define AD1ACQCON                     780
#define AD1ACQCON_ADACQ0              781
#define AD1ACQCON_ADACQ               782
#define AD1ACQCON_ADACQ1              783
#define AD1ACQCON_ADACQ2              784
#define AD1ACQCON_ADACQ3              785
#define AD1ACQCON_ADACQ4              786
#define AD1ACQCON_ADACQ5              787
#define AD1ACQCON_ADACQ6              788
#define AD1GRD                        789
#define TX1POL                        790
#define AD1GRD_TXPOL                  791
#define GRD1POL                       792
#define AD1GRD_GRDPOL                 793
#define AD1GRD_GRDAOE                 794
#define GRD1AOE                       795
#define GRD1BOE                       796
#define AD1GRD_GRDBOE                 797
#define AD1CAPCON                     798
#define AD1CAPCON_ADDCAP              799
#define ADD1CAP                       800
#define AD1CAPCON_ADDCAP0             801
#define AD1CAPCON_ADCAP               802
#define AD1CAPCON_ADDCAP1             803
#define AD1CAPCON_ADDCAP2             804
#define AD1CAPCON_ADDCAP3             805
#define AAD1RES0L                     806
#define AAD1RES0L_ADRESL              807
#define AAD1RES0H                     808
#define AAD1RES0H_ADRESH              809
#define AAD1RES1L                     810
#define AAD1RES1L_ADRESL              811
#define AAD1RES1H                     812
#define AAD1RES1H_ADRESH              813
#define AD1CH0                        814
#define CH10                          815
#define CH11                          816
#define CH12                          817
#define CH13                          818
#define CH14                          819
#define CH15                          820
#define CH16                          821
#define CHS17                         822
#define AD1CH1                        823
#define CH18                          824
#define CH19                          825
#define CH30                          826
#define CH31                          827
#define CH32                          828
#define CH33                          829
#define CH34                          830
#define CH35                          831
#define AD2CON0                       832
#define AD2ON                         833
#define AD2CON0_ADON                  834
#define GO_nDONE2                     835
#define AD2CON0_GO                    836
#define AD2CON0_GO_nDONE              837
#define AD2CON0_CHS                   838
#define AD2CON0_CHS0                  839
#define AD2CON0_CHS1                  840
#define AD2CON0_CHS2                  841
#define AD2CON0_CHS3                  842
#define AD2CON0_CHS4                  843
#define AD2CON0_CHS5                  844
#define AD2CON2                       845
#define AD2CON2_TRIGSEL0              846
#define AD2CON2_TRIGSEL               847
#define AD2CON2_TRIGSEL1              848
#define AD2CON2_TRIGSEL2              849
#define AD2CON3                       850
#define AD2CON3_ADDSEN                851
#define AD2DSEN                       852
#define AD2IPEN                       853
#define AD2CON3_ADIPEN                854
#define AD2IPPOL                      855
#define AD2CON3_ADIPPOL               856
#define AD2CON3_ADEPPOL               857
#define AD2EPPOL                      858
#define AD2PRECON                     859
#define AD2PRECON_ADPRE0              860
#define AD2PRECON_ADPRE               861
#define AD2PRECON_ADPRE1              862
#define AD2PRECON_ADPRE2              863
#define AD2PRECON_ADPRE3              864
#define AD2PRECON_ADPRE4              865
#define AD2PRECON_ADPRE5              866
#define AD2PRECON_ADPRE6              867
#define AD2ACQCON                     868
#define AD2ACQCON_ADACQ0              869
#define AD2ACQCON_ADACQ               870
#define AD2ACQCON_ADACQ1              871
#define AD2ACQCON_ADACQ2              872
#define AD2ACQCON_ADACQ3              873
#define AD2ACQCON_ADACQ4              874
#define AD2ACQCON_ADACQ5              875
#define AD2ACQCON_ADACQ6              876
#define AD2GRD                        877
#define AD2GRD_TXPOL                  878
#define TX2POL                        879
#define AD2GRD_GRDPOL                 880
#define GRD2POL                       881
#define AD2GRD_GRDAOE                 882
#define GRD2AOE                       883
#define AD2GRD_GRDBOE                 884
#define GRD2BOE                       885
#define AD2CAPCON                     886
#define AD2CAPCON_ADDCAP              887
#define AD2CAPCON_ADCAP               888
#define ADD2CAP                       889
#define AD2CAPCON_ADDCAP0             890
#define AD2CAPCON_ADDCAP1             891
#define AD2CAPCON_ADDCAP2             892
#define AD2CAPCON_ADDCAP3             893
#define AAD2RES0L                     894
#define AAD2RES0L_ADRESL              895
#define AAD2RES0H                     896
#define AAD2RES0H_ADRESH              897
#define AAD2RES1L                     898
#define AAD2RES1L_ADRESL              899
#define AAD2RES1H                     900
#define AAD2RES1H_ADRESH              901
#define AD2CH0                        902
#define CH20                          903
#define CH21                          904
#define CH22                          905
#define CH23                          906
#define CH24                          907
#define CH25                          908
#define CH26                          909
#define CH27                          910
#define AD2CH1                        911
#define CH28                          912
#define CH29                          913
#define CH40                          914
#define CH41                          915
#define CH42                          916
#define CH43                          917
#define CH44                          918
#define CH45                          919
#define ICDIO                         920
#define TRIS_ICDCLK                   921
#define TRIS_ICDDAT                   922
#define LAT_ICDCLK                    923
#define LAT_ICDDAT                    924
#define PORT_ICDCLK                   925
#define PORT_ICDDAT                   926
#define ICDCON0                       927
#define RSTVEC                        928
#define DBGINEX                       929
#define SSTEP                         930
#define FREEZ                         931
#define INBUG                         932
#define ICDSTAT                       933
#define USRHLTF                       934
#define TRP0HLTF                      935
#define TRP1HLTF                      936
#define ICDINSTL                      937
#define DBGIN0                        938
#define DBGIN1                        939
#define DBGIN2                        940
#define DBGIN3                        941
#define DBGIN4                        942
#define DBGIN5                        943
#define DBGIN6                        944
#define DBGIN7                        945
#define ICDINSTH                      946
#define DBGIN8                        947
#define DBGIN9                        948
#define DBGIN10                       949
#define DBGIN11                       950
#define DBGIN12                       951
#define DBGIN13                       952
#define ICDBK0CON                     953
#define BKHLT                         954
#define BKEN                          955
#define ICDBK0L                       956
#define BKA0                          957
#define BKA1                          958
#define BKA2                          959
#define BKA3                          960
#define BKA4                          961
#define BKA5                          962
#define BKA6                          963
#define BKA7                          964
#define ICDBK0H                       965
#define BKA8                          966
#define BKA9                          967
#define BKA10                         968
#define BKA11                         969
#define BKA12                         970
#define BKA13                         971
#define BKA14                         972
#define BSRICDSHAD                    973
#define BSR_ICDSHAD                   974
#define STATUS_SHAD                   975
#define C_SHAD                        976
#define DC_SHAD                       977
#define Z_SHAD                        978
#define WREG_SHAD                     979
#define BSR_SHAD                      980
#define PCLATH_SHAD                   981
#define FSR0L_SHAD                    982
#define FSR0H_SHAD                    983
#define FSR1L_SHAD                    984
#define FSR1H_SHAD                    985
#define STKPTR                        986
#define TOSL                          987
#define TOSH                          988

#endif // _PIC16LF1567_H_
